IRP/src/Catalogs/DepreciationSchedules/DepreciationSchedules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>DepreciationSchedules</name>
 <attributes>
  <name>CalculationMethod</name>
  <type>
   <types>EnumRef.DepreciationMethods</types>
  </type>
 </attributes>
 <attributes>
  <name>UsefulLife</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>5</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Rate</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/DepreciationMethods/DepreciationMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>DepreciationMethods</name>
 <enumValues>
  <name>StraightLine</name>
 </enumValues>
 <enumValues>
  <name>DecliningBalance</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/DepreciationSchedules/Forms/ItemForm/Module.bsl
#Region FormEvents

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	AddAttributesAndPropertiesServer.BeforeWriteAtServer(ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		AddAttributesCreateFormControl();
	EndIf;
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	If Parameters.Key.IsEmpty() Then
		SetVisibilityAvailability(Object, ThisObject);
	EndIf;
	
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	AddAttributesAndPropertiesServer.OnCreateAtServer(ThisObject);
	ExtensionServer.AddAttributesFromExtensions(ThisObject, Object.Ref, Items.GroupMainPages);	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)
	SetVisibilityAvailability(CurrentObject, ThisObject);
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	SetVisibilityAvailability(CurrentObject, ThisObject);
EndProcedure

&AtClient
Procedure CalculationMethodOnChange(Item)
	If Object.CalculationMethod <> PredefinedValue("Enum.DepreciationMethods.DecliningBalance") Then
		Object.Rate = 0;
	EndIf;
	
	If Object.CalculationMethod <> PredefinedValue("Enum.DepreciationMethods.StraightLine") Then
		Object.UsefulLife = 0;
	EndIf;
	
	SetVisibilityAvailability(Object, ThisObject);
EndProcedure

#EndRegion

&AtClientAtServerNoContext
Procedure SetVisibilityAvailability(Object, Form)
	Form.Items.UsefulLife.Visible = (Object.CalculationMethod = PredefinedValue("Enum.DepreciationMethods.StraightLine"));
	Form.Items.Rate.Visible = (Object.CalculationMethod = PredefinedValue("Enum.DepreciationMethods.DecliningBalance"));
EndProcedure

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

#Region AddAttributes

&AtClient
Procedure AddAttributeStartChoice(Item, ChoiceData, StandardProcessing) Export
	AddAttributesAndPropertiesClient.AddAttributeStartChoice(ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Procedure AddAttributesCreateFormControl()
	AddAttributesAndPropertiesServer.CreateFormControls(ThisObject);
EndProcedure

&AtClient
Procedure AddAttributeButtonClick(Item) Export
	AddAttributesAndPropertiesClient.AddAttributeButtonClick(ThisObject, Item);
EndProcedure

#EndRegion
